Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །ཆོས་ཉན་པར་འཚལ་བའི་ཚེ། སྔར་རྒྱལ་པོ་ལ་གཅེས་པའི་ཕོ་བྲང་མཆོག་དམ་པ་རབ་ཏུ་བརྒྱན་ཏེ་གསལ་བའི་ཕྱོགས་སུ་སྤོས་ཆབ་ཀྱིས་ཆག་ཆག་བཏབ་སྟེ། མེ་ཏོག་མཆོག་དམ་པ་སྣ་ཚོགས་མངོན་པར་གཏོར་ནས་སེང་གེའི་ཁྲི་ཆོས་ཀྱི་གདན་ཁྱད་པར་དུ་འཕགས་པ་བཙུགས་ཏེ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་ནས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: When he wishes to listen to this Dharma, he should first adorn a sublime, supreme palace that is dear to the king, sprinkle scented water on a clear area, scatter various sublime, perfect flowers, set up a lion throne as a superior Dharma seat, adorn it with various jewels, and erect parasols, banners, and flags.

source: བ་དན་བསྒྲེང་སྟེ། རིན་ཐང་མ་མཆིས་པའི་སྦོས་བསྲེགས་ནས་རོལ་མོ་རྣམས་བགྱིའོ།
en: He should burn priceless incense and have music played.

source: །རྒྱལ་པོ་དེས་དེའི་ཚེ་ཡོངས་སུ་དག་པར་ཁྲུས་བགྱིས་ཏེ། སྤོས་ཀྱི་བྱུག་པས་ལུས་བསྐུས་ནས་གོས་སར་པ་གཙང་མ་བགོས་ཏེ། རྒྱན་ཕྲེང་རྣམས་ཀྱིས་བརྒྱན་ནས་སྟན་དམའ་བ་ལ་མཆིས་ཏེ། མཐོ་བའི་བསམ་པ་མི་བསྐྱེད་པར་དབང་ཕྱུག་གི་ཐབས་ཡོངས་སུ་སྤང་བར་བགྱིའོ།
en: Then, that human king should wash his body clean, anoint his body with perfumed ointments, put on new, clean clothes, adorn himself with strings of jewelry, and sit on a low seat, without thoughts of superiority, forsaking the demonstration of his power.

source: །ང་རྒྱལ་རྣམས་སྤངས་ཏེ་སེམས་རྩེ་གཅིག་ཏུ་དྲན་པ་ཉེ་བར་གཞག་ནས་མདོ་སྡེའི་རྒྱལ་པོ་འདི་མཉན་པར་བགྱིའོ།
en: He should listen to this king of sūtras free of pride and with one-pointed mindfulness. “

source: །ཆོས་སྨྲ་བའི་མཁན་པོ་ལ་སྟོན་པ་ཆེན་པོའི་འདུ་ཤེས་བསྐྱེད་པར་བགྱིའོ།
en: He should also perceive the upādhyāya who recites this Dharma to be a great teacher.

source: །ཕོ་བྲང་ནང་གི་བཙུན་མོ་དང་། རྒྱལ་བུ་དང་། སླས་དང་། འཁོར་རྣམས་ལ་བྱམས་པ་དང་། བརྩེ་བའི་སེམས་བསྐྱེད་ནས་རབ་ཏུ་དགའ་བས་ཕན་ཚུན་བལྟ་བར་བགྱིའོ།
en: He should have love for his queens, princes, attendants, and court within the palace, and they should look at one another with great happiness.

source: །ཤིན་ཏུ་མཐུན་པའི་མདངས་ཀྱིས་ཚིག་འཇམ་པོར་སྨྲ་བར་བགྱིའོ།
en: He should speak to them with gentle words and an air of harmony.

source: །བདག་ཉིད་ཀྱི་ལུས་དང་སེམས་ལ་དགའ་བ་ཆེན་པོས་ཀུན་དུ་ཁྱབ་པར་བགྱིའོ། །དེང་བདག་ནི་ཤིན་ཏུ་བསམ་པར་དཀའ་ཞིང་ཁྱད་པར་དུ་འཕགས་པའི་ཕན་ཡོན་ཆེན་པོ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་འདི་ལྟ་བུ་འཐོབ་པར་འགྱུར་རོ་སྙམ་དུ་བསམས་ནས་མདོ་སྡེའི་རྒྱལ་པོ་དེ་ལ་རབ་ཏུ་མཆོད་པར་བགྱིའོ།
en: His own body and mind should be filled with great happiness, thinking, ‘Today I have attained pure thoughts and this immense, vast, great, superior benefit,’ and he should make offerings to this king of sūtras. “

source: །དེ་ལྟར་བསམས་ལགས་ནས་ཆོས་སྨྲ་བའི་མཁན་པོ་དེར་མཆིས་པ་མཐོང་བར་གྱུར་ན་ཤིན་ཏུ་གུས་པས་དཀོན་པའི་འདུ་ཤེས་བསྐྱེད་པར་བགྱིའོ།
en: Thinking in that way when he sees the upādhyāya who recites the Dharma coming toward him, he should reverently perceive him as a rarity.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་ལ་བཀའ་སྩལ་པ། འདི་ལྟར་ཆོས་སྨྲ་བའི་མཁན་པོ་དེ་མི་བསུ་བར་མི་བྱའི།
en: Then the Bhagavat said to the Four Mahārājas, “Mahārājas, in that way, this upādhyāya who recites the Dharma should not be without a welcome.

source: དེའི་ཚེ་མིའི་རྒྱལ་པོ་དེས་གོས་སར་པ་གཙང་མ་བགོས་ནས་རྒྱན་དང་། ཕྲེང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་ཏེ།
en: At that time, in that moment, that human king should wear clean, new clothes and adorn himself with various strings of jewels.

source: བདག་ཉིད་གདུགས་དཀར་པོ་དང་། སྤོས་དང་། མེ་ཏོག་ཐོགས་ནས་དམག་གི་དཔུང་བཤམས་ཏེ། རོལ་མོ་རྒྱས་པར་བྱས་ནས་རྐང་གིས་གྲོང་ཁྱེར་ནས་ཕྱིར་བྱུང་སྟེ།
en: He should himself hold a white parasol, incense, and flowers, and, assembling his army and having music played extensively, he should come out of the city on foot.

source: བཀྲ་ཤིས་ཀྱི་དངོས་པོ་ཐོབ་པར་བྱ་བའི་ཕྱིར་གུས་པའི་འདུ་ཤེས་བསྐྱེད་ནས་ཆོས་སྨྲ་བའི་མཁན་པོ་དེ་བསུ་བར་བྱའོ།
en: In order to gain auspiciousness, with an attitude of reverence he should welcome the upādhyāya who recites the Dharma. “

source: །རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་རྒྱུ་དང་རྐྱེན་གང་གི་ཕྱིར་མིའི་རྒྱལ་པོ་དེས་བདག་ཉིད་ཀྱིས་བཀུར་སྟི་དང་། མཆོད་པ་དེ་ལྟ་བུ་བྱ་དགོས་ཤེ་ན།
en: Four Mahārājas, for what cause and condition should the human king himself honor and make offerings in that way?

source: མིའི་རྒྱལ་པོ་དེ་རྐང་པ་བཏེག་ཅིང་རྐང་པ་བཞག་པ་ན་གོམ་པ་རེ་རེ་ཞིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་པོ་རྣམས་ལ་བཀུར་སྟི་དང་། མཆོད་པ་དང་། རིམ་གྲོ་དང་། བླ་མར་བྱེད་པར་འགྱུར་ཞིང་།
en: It is because with each step in which the human king lifts and sets down his foot, he is honoring, making offerings to, serving, and showing reverence to a hundred thousand quintillion bhagavats.

source: གཞན་ཡང་བསྐལ་པའི་གྲངས་དེ་སྙེད་ཀྱི་འཁོར་བའི་སྡུག་བསྔལ་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་བས་སོ།
en: Moreover, for that number of eons he will truly transcend the suffering of saṃsāra.

source: །གཞན་ཡང་མ་འོངས་པའི་དུས་ན་བསྐལ་པའི་གྲངས་དེ་སྙེད་དུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་ལོངས་སྤྱོད་མཆོག་ཁྱད་པར་དུ་འཕགས་པ་དག་ལ་ལོངས་སྤྱོད་པར་འགྱུར།
en: Moreover, he will enjoy the superior, supreme enjoyments of a cakravartin king for that number of eons.

source: གོམ་པ་རེ་རེ་བོར་བའི་དབང་གིས་ཚེ་འདི་ཉིད་ལ་ཡང་བསོད་ནམས་འཕེལ་བས་རང་དབང་དུ་རྒྱལ་པོ་བྱེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་སྨིན་པ་དང་ལྡན་པ་དང་། མང་པོ་ཀུན་གྱིས་བཀུར་བར་འགྱུར། བསྐལ་པ་འབུམ་ཕྲག་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་དུ་ལྷ་དང་མིས་ཡོངས་སུ་སྤྱད་པའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གཞལ་མེད་ཁང་དག་ལ་ལོངས་སྤྱོད་པར་འགྱུར།
en: Through the power of each step, his merit in that life will increase so that so he will have independent sovereignty and an inconceivable ripening of results, will be venerated by entire multitudes, and for countless hundreds of thousands of eons will enjoy a divine palace made of the seven precious materials that is delighted in by devas and humans.

source: སྐྱེ་བ་ཐམས་ཅད་དུ་རྒྱལ་པོ་བྱེད་པར་འགྱུར། ཚེ་རིང་བར་འགྱུར། ཚིག་གི་སྤོབས་པ་དང་ལྡན་པས་ལྷ་དང་མི་ཀུན་གྱིས་མངོན་པར་ཡིད་ཆེས་པར་འགྱུར།
en: In all his lifetimes, he will be a king with a long life and eloquent words and will be trusted by devas and humans.

source: འཇིགས་ཤིང་སྐྲག་པ་མེད་པར་འགྱུར།
en: He will have no fears or terrors.

source: གྲགས་པ་ཆེན་པོ་དང་ལྡན་ཞིང་མང་པོ་ཀུན་གྱིས་ཡོངས་སུ་བལྟ་བར་འགྱུར།
en: He will have great fame and be looked up to by entire multitudes.

source: ལྷ་དང་མིའི་ནང་དུ་ཁྱད་པར་དུ་འཕགས་པའི་བདེ་བ་དག་ལ་ལོངས་སྤྱོད་པར་འགྱུར།
en: He will enjoy the highest bliss among devas and humans.

source: མཐུ་སྟོབས་ཆེན་པོ་ཐོབ་པར་འགྱུར།
en: He will attain great strength.

source: གཟི་བྱིན་ཆེན་པོའི་ཡོན་ཏན་དང་ལྡན་པར་འགྱུར།
en: He will have the qualities of great magnificence.

source: ལུས་ཀྱི་མཚན་མ་གྱ་ནོམ་ཞིང་ཤིན་ཏུ་མཛེས་པས་དཔེ་ཟླ་མེད་པར་འགྱུར།
en: The features of his body will be excellent and beautiful beyond equal or analogy.

source: ལྷ་དང་མིའི་སྟོན་པ་མཐོང་བར་འགྱུར།
en: He will see the teacher of devas and humans.

source: དགེ་བའི་བཤེས་གཉེན་དང་ཕྲད་པར་འགྱུར།
en: He will meet kalyāṇamitras.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པ་མངོན་པར་གྲུབ་ཅིང་ཕུན་སུམ་ཚོགས་པར་འགྱུར་རོ།
en: He will accomplish an immeasurable accumulation of merit and have perfect good fortune. “

source: །རྒྱལ་པོ་ཆེན་པོ་དག་འདི་ལྟར་ཤེས་པར་བྱ་སྟེ། མིའི་རྒྱལ་པོ་དེ་དག་གིས་ཡོན་ཏན་གྱི་ཕན་ཡོན་རྣམ་པ་སྣ་ཚོགས་ཚད་མེད་པ་དེ་ལྟ་བུ་མཐོང་བའི་ཕྱིར་བདག་ཉིད་དཔག་ཚད་གཅིག་ནས་དཔག་ཚད་བརྒྱ་སྟོང་དུ་མའི་བར་དུ་ཆོས་སྨྲ་བའི་མཁན་པོ་བསུ་བར་བྱ་ཞིང་།
en: Mahārājas, know this: those human kings, in order to see measureless, various beneficial qualities, will themselves go from one yojana up to a hundred thousand yojanas in order to greet the dharmabhāṇaka upādhyāyas, and they will perceive those dharmabhāṇaka upādhyāyas to be the Teacher. “

source: ཆོས་སྨྲ་བའི་མཁན་པོ་ལ་སངས་རྒྱས་ཀྱི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །སླར་གྲོང་དང་། གྲོང་ཁྱེར་དུ་ཕྱིན་ནས་ཀྱང་དེང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་བདག་གི་ཕོ་བྲང་དུ་གཤེགས་ནས་བདག་གི་མཆོད་པ་བཞེས་ཏེ་བདག་ལ་ཆོས་སྟོན་པར་མཛད་དོ།
en: Then, when he goes to the town or city, he should think, ‘Today the tathāgata arhat samyaksaṃbuddha Śākyamuni is coming to my palace and will receive my offerings, and he will teach me the Dharma.

source: །བདག་ཀྱང་ཆོས་ཐོས་པའི་དབང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པར་མི་འགྱུར་བས་འདི་ཉིད་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་ཕྲད་པར་གྱུར་པ་ཡིན་ནོ།
en: Through the power of my hearing the Dharma, I will become irreversible in my progress toward the highest, most complete enlightenment, so that this is the same as meeting many hundreds of thousands of quintillions of buddha bhagavats.

source: །དེང་བདག་གིས་ནི་ཤིན་ཏུ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་མཆོག་ཏུ་ཁྱད་པར་དུ་འཕགས་པའི་བདེ་བའི་ཡོ་བྱད་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བཞུགས་པའི་སངས་རྒྱས་རྣམས་ལ་མཆོད་ཅིང་རིམ་གྲོ་བྱས་སོ།
en: Today I have made very immense, vast, supreme, superior offerings of pleasant requisites of various kinds to the buddhas of the past, the future, and the present and honored them.

source: །དེང་བདག་གིས་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་དང་། སེམས་ཅན་དམྱལ་བ་དང་། ཡི་དགས་དང་། དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་རྩ་བ་ནས་བཏོན་ཏོ།
en: Today I have uprooted all the suffering in the world of Yama, the hells, the pretas, and the animal rebirths.

source: །དེང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་ཀྱི་དགེ་བའི་རྩ་བ་རབ་ཏུ་བསྐྱེད་དོ།
en: Today I have planted the roots of merit for attaining countless hundreds of thousands of quintillions of rebirths as cakravartins, Śakras, and Brahmās.

source: །དེང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་འཁོར་བའི་སྡུག་བསྔལ་ལས་བཏོན་ནས་མྱ་ངན་ལས་འདས་པའི་བདེ་བ་ལ་བཀོད་དོ།
en: Today I have saved countless hundreds of thousands of quintillions of beings from the suffering of saṃsāra and placed them in the bliss of nirvāṇa.

source: །དེང་ཚད་མེད་མཐའ་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་རབ་ཏུ་བསགས་སོ།
en: Today I have accumulated an endless, incalculable aggregation of inconceivable merit.

source: །ཕོ་བྲང་ནང་གི་སླས་དང་སྐྱེ་བོ་མང་པོ་བདེ་བ་ལ་བཀོད་ནས་ཡུལ་རྣམས་རབ་ཏུ་ཞི་བར་བྱས་པས། གནོད་པ་དང་། དུག་གདུག་པ་དང་།
en: I have established in happiness the many attendants and people in the palace and brought peace to the land, so that there are no harms, pernicious poisons, or malevolent humans.

source: མི་མ་རུངས་པ་མེད་ཅིང་ཕྱོགས་གཞན་ནས་འོང་བའི་དགྲ་རྣམས་ཉེ་བར་འོངས་ནས་གནོད་པ་མི་བྱེད་པ་དང་། མྱ་ངན་དང་ནད་རྣམས་མེད་པར་འགྱུར་རོ་སྙམ་དུ་བསམ་པར་བྱའོ། །རྒྱལ་པོ་ཆེན་པོ་དག་འདི་ལྟར་རིག་པར་བྱ་སྟེ། དེའི་ཚེ་མིའི་རྒྱལ་པོ་དེ་དག་གིས་དེ་ལྟར་ཡང་དག་པའི་ཆོས་ལ་བཙུན་པར་བྱས་ཤིང་བླ་མར་བྱས་པ་དང་། མདོ་སྡེ་དམ་པ་འདི་ཡོངས་སུ་འཛིན་པའི་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། །དགེ་བསྙེན་དང་།
en: Enemies from elsewhere will not come and cause harm and there will be no misery or illness.’ “

source: དགེ་བསྙེན་མ་དག་ལ་མཆོད་པ་དང་། བཀུར་སྟི་དང་། བླ་མར་བྱས་ཤིང་བསྔགས་པ་བརྗོད་པ་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བ་གང་ཡིན་པ་དེ་དག་དང་། བསོད་ནམས་མཆོག་གང་ཡིན་པ་དེ་དག་ཐོག་མ་ཁོ་ནར་ཁྱེད་འཁོར་དང་བཅས་པ་ལས་ཡོངས་སུ་སྔོ་བར་བྱེད་ན་མིའི་རྒྱལ་པོ་དེ་དག་བསོད་ནམས་ཆེན་པོའི་དགེ་བའི་ལས་ཀྱི་རྒྱུ་དང་། རྐྱེན་དང་ལྡན་པར་འགྱུར་བས་ཚེ་འདི་ཉིད་ལ་དབང་ཆེན་པོ་ཐོབ་ནས་གཟི་བྱིན་ཆེན་པོ་རབ་ཏུ་འཕེལ་བར་འགྱུར།
en: Mahārājas, know this: When at that time those kings in that way revere and venerate the true Dharma and make offerings to, honor, venerate, and praise the bhikṣus, bhikṣunīs, upāsakas, and upāsikās who possess this sublime sūtra, if they first dedicate the roots of merit and supreme merit that come from that solely to you and your followers, then those human kings will possess the great merit of good karma as a cause and condition, and in that life they will attain great power and their magnificence will increase.

source: དཔལ་དང་མཚན་མཆོག་རྣམས་ཀྱིས་རབ་ཏུ་བརྒྱན་པར་འགྱུར། ཕྱིར་རྒོལ་བ་ཐམས་ཅད་ཡང་དག་པའི་ཆོས་ཀྱིས་ཚར་གཅོད་པར་འགྱུར་རོ།
en: They will be adorned by splendor and supreme features, and all their adversaries will be eliminated by the true Dharma.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོ་གང་ལ་ལ་ཞིག་དེ་ལྟར་ཡང་དག་པའི་ཆོས་ལ་གུས་པས་བཀུར་སྟི་བགྱིས་ནས་མདོ་སྡེ་འདི་མཉན་པར་བགྱིད་པ་དང་། མདོ་སྡེ་འདི་འཛིན་པའི་འཁོར་བཞི་པོ་དག་ལ་བཀུར་སྟི་དང་། མཆོད་པ་དང་། བླ་མར་བགྱིས་ནས་བསྔགས་པ་བརྗོད་པར་བགྱིད་པ་ན།
en: The Four Mahārājas then said to the Bhagavat, “Bhagavat, when any human king in that way honors the true Dharma with reverence and listens to this sūtra, and honors, makes offerings to, venerates, and praises the four kinds of followers who possess this sūtra, then at that time, that king, in order to please us, should sprinkle scented water and scatter many sublime, perfect flowers upon the place where the Dharma seat is situated, and place and arrange seats for the Four Mahārājas.

source: དེའི་ཚེ་མིའི་རྒྱལ་པོ་དེས་བདག་ཅག་རྣམས་དགའ་བར་བགྱི་བའི་སླད་དུ་ཆོས་ཀྱི་གདན་དང་ཉེ་བའི་ཕྱོགས་གཅིག་ཏུ་སྤོས་ཆབ་ཀྱིས་ཆག་ཆག་བཏབ་སྟེ། མེ་ཏོག་མཆོག་དམ་པ་མང་པོ་མངོན་པར་གཏོར་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་མཆིས་པའི་སྟན་ཡང་བཤམས་ཏེ་བཏིང་བར་གྱུར་ན།
en: Then we will listen to the Dharma together with that king. “

source: བདག་ཅག་ཀྱང་རྒྱལ་པོ་དེ་དག་དང་ལྷན་ཅིག་ཡང་དག་པའི་ཆོས་ཉན་པར་བགྱིད་དོ། །རྒྱལ་པོ་དེས་ཀྱང་བདག་ཅག་ལ་ཕན་འདོགས་པའི་དགེ་བའི་རྩ་བ་ཅི་མཆིས་པའི་བསོད་ནམས་ཀྱི་སྐལ་བ་གང་ལགས་པ་བདག་ཅག་ལ་ཡང་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ།
en: That king should then dedicate to us whatever share of the merit of good roots will be beneficial for us. “

source: །བཅོམ་ལྡན་འདས་དེའི་ཚེ་མིའི་རྒྱལ་པོ་དེས་ཆོས་སྨྲ་བ་ལ་ཆོས་བཤད་པར་གསོལ་བ་བཏབ་ནས་སྟན་ལ་མཆིས་པའི་ཚེ་བདག་ཅག་གི་སླད་དུ་སྤོས་མཆོག་དམ་པ་སྣ་ཚོགས་བསྲེགས་ནས་མདོ་སྡེ་འདི་ལ་མཆོད་པར་བགྱིའོ།
en: Bhagavat, at that time, that human king should supplicate the dharmabhāṇaka to teach the Dharma, and when the dharmabhāṇaka is on their seat, the king should burn various sublime, supreme incenses for us and then make an offering to this sūtra. “

source: །བཅོམ་ལྡན་འདས་དེའི་ཚེ་སྤོས་ཀྱི་བདུག་པ་དེ་དག་སྐད་ཅིག་མ་གཅིག་ལ་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ནས་བདག་ཅག་རྣམས་ཀྱི་གཞལ་མེད་ཁང་དུ་མཆིས་ཏེ།
en: Bhagavat, at that time, the aroma of that incense will in a single instant rise into the sky and pervade our aerial palaces.

source: སྤོས་ཀྱི་གདུགས་སུ་འགྱུར་བས་བདག་ཅག་ལྷའི་འཁོར་རྣམས་ཀྱིས་ཀྱང་སྤོས་ཀྱི་དྲི་མཆོག་དེ་ཚོར་བར་འགྱུར། སྤོས་ཀྱི་དུ་བ་དེ་ཡང་གསེར་གྱི་འོད་དང་ལྡན་པས་བདག་ཅག་གནས་པའི་ཁང་ཁྱིམ་ནས་ཚངས་པའི་གནས་དང་། བརྒྱ་བྱིན་ལྷའི་དབང་པོ་དང་། ལྷ་མོ་སྤོབས་པ་ཆེན་མོ་དང་། ལྷ་མོ་དཔལ་ཆེན་མོ་དང་།
en: It will transform into a parasol of incense, and our divine entourages will smell the supreme aroma of the incense.

source: སའི་ལྷ་མོ་བརྟན་མ་དང་། སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་། ལྷའི་རྒྱལ་པོ་དབང་ཕྱུག་ཆེན་པོ་དང་། ལག་ན་རྡོ་རྗེ་གསང་བའི་བདག་པོ་དང་།
en: The smoke of the incense will have a golden light that will illuminate our palaces and the residence of Brahmā, and all the residences of Śakra, lord of devas; of the goddess Sarasvatī; of the great goddess Śrī; of Dṛḍhā, goddess of the earth; of the great general Saṃjñeya; of the twenty-eight great yakṣa generals; of Maheśvara, the king of devas; of Vajrapāṇi, the lord of secrets; of the great general Māṇibhadra; of Hārītī with her entourage of five hundred children; of the nāga king Anavatapta; and of the nāga king Sāgara. “

source: སྡེ་དཔོན་ཆེན་པོ་རིན་ཆེན་བཟང་དང་། འཕྲོག་མའི་བུ་འཁོར་ལྔ་བརྒྱ་པ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་གནས་ཀྱི་བར་ཐམས་ཅད་ཀྱང་རབ་ཏུ་གསལ་བར་བགྱིད་དོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་བུ་ལ་སོགས་པའི་འཁོར་རྣམས་ཀྱིས་རང་རང་གི་གཞལ་མེད་ཁང་དུ་སྤོས་ཀྱི་བདུག་པ་དེས་སྐད་ཅིག་ཡུད་ཙམ་ཅིག་ལ་སྤོས་ཀྱི་གདུགས་སུ་གྱུར་པར་ཡང་མཐོང་ལ་སྤོས་ཀྱི་དྲི་ཡང་ཚོར་བར་འགྱུར།
en: Bhagavat, in that way, the aroma of the incense in the aerial palaces of each of those and their entourages, and of others, will instantly transform into parasols of incense that are seen and their aroma experienced.

source: འོད་ཟེར་གྱི་ཁ་དོག་གིས་ལྷའི་གཞལ་མེད་ཁང་ཐམས་ཅད་གསལ་བར་བགྱིད་པ་ཡང་མཐོང་བར་འགྱུར་ལགས་སོ།
en: Their colored light rays will also be seen to illuminate all the divine aerial palaces.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་ལ་བཀའ་སྩལ་པ། སྤོས་ཀྱི་འོད་ཟེར་དེས་གཞལ་མེད་ཁང་དེ་དག་འབའ་ཞིག་གསལ་བར་བྱས་ནས་སྤོས་ཀྱི་གདུགས་སུ་གྱུར་ཏེ་འོད་ཟེར་ཆེན་པོ་འགྱེད་པ་མ་ཡིན་ཏེ། མིའི་རྒྱལ་པོ་དེ་དག་ལག་པས་པོག་ཕོར་བཟུང་སྟེ།
en: The Bhagavat said to the Four Mahārājas, “Mahārājas, the light rays of the incense will not illuminate, transform into parasols of incense, and radiate great light rays solely at those aerial palaces.

source: སྤོས་མཆོག་དམ་པ་བསྲེགས་ནས་མདོ་སྡེ་འདི་ལ་མཆོད་པ་བྱེད་པའི་ཚེ་སྤོས་ཀྱི་དུ་བ་དེ་ཐང་ཅིག་ཡུད་ཙམ་གཅིག་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ཡོད་པའི་ཉི་མ་དང་། ཟླ་བ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། རིའི་རྒྱལ་པོ་རི་རབ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། གླིང་བཞི་པ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་།
en: When the human king holds the censer in his hands, burns the sublime, supreme incense, and makes an offering to this sūtra, the smoke of that incense will in an instant, in a moment, fill up the billion suns and moons, the billion Sumerus, kings of mountains, the billion four-continent worlds that are in the trichiliocosm world realm, and all the palaces of the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas that there are in the trichiliocosm world realm—it will spread and fill all of space.

source: ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་ཁང་ཁྱིམ་ཐམས་ཅད་གསལ་བར་བྱས་ནས་ནམ་མཁའ་ཀུན་དུ་གང་ཞིང་རྒྱས་པ་དང་། སྤོས་ཀྱི་བདུག་པ་རྣམ་པ་སྣ་ཚོགས་གང་ཡིན་པ་དེ་དག་སྤྲིན་གྱི་གདུགས་སུ་གྱུར་ཏེ། གདུགས་དེ་ཡང་གསེར་གྱི་ཁ་དོག་དང་ལྡན་པས་ལྷའི་ཁང་ཁྱིམ་ཐམས་ཅད་གསལ་བར་བྱེད་དེ།
en: The various kinds of incense aromas will transform into parasols of incense, and those parasols will be golden in color and will illuminate all divine palaces. “

source: འདི་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སྤོས་ཀྱི་སྤྲིན་དང་། སྤོས་ཀྱི་གདུགས་རྣམ་པ་སྣ་ཚོགས་ཇི་སྙེད་ཡོད་པ་ཐམས་ཅད་ནི་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོའི་གཟི་བྱིན་གྱི་མཐུ་ལས་གྱུར་པ་ཡིན་ནོ།
en: In that way, all the clouds of incense and parasols of incense of various kinds there will be in the trichiliocosm world realm are the result of the power of the magnificence of The Sublime Golden Light, the Supremely Victorious King of Sūtras. “

source: །མིའི་རྒྱལ་པོ་དེ་དག་ལག་ཏུ་པོག་ཕོར་ཐོགས་ནས་མདོ་སྡེ་འདི་ལ་མཆོད་པར་བྱེད་པའི་ཚེ་སྤོས་ཀྱི་བདུག་པ་རྣམ་པ་སྣ་ཚོགས་གང་ཡིན་པ་དེ་དག་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་འབའ་ཞིག་ཏུ་ཁྱབ་པར་འགྱུར་བ་མ་ཡིན་གྱི།
en: And when the human king holds the censer in his hands and makes an offering to this sūtra, it is not only this trichiliocosm world realm that is pervaded by all the various aromas of that incense.

source: སྐད་ཅིག་ཡུད་ཙམ་གཅིག་གིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་མཐའ་མེད་པ་ཀུན་དུ་ཁྱབ་ཅིང་།
en: In an instant, in a moment, they pervade countless, endless hundreds of thousands of quintillions of buddha realms in the ten directions that are as numerous as the grains of sand in the Ganges River.

source: སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱི་ནམ་མཁའ་ཀུན་དུ་སྤོས་ཀྱི་གདུགས་སུ་གྱུར་ནས་ཀུན་དུ་གསལ་བར་བྱེད་པ་ཡང་དེ་བཞིན་ཏེ།
en: They become parasols of incense in the skies above all the buddha realms and completely illuminate them in a similar fashion. “

source: དེའི་ཚེ་སངས་རྒྱས་མང་པོ་དེ་དག་སྤོས་གྱ་ནོམ་པའི་དྲི་གང་ཡིན་པ་དེ་དག་ཀྱང་རིག་ཅིང་མཁྱེན། སྤོས་ཀྱི་བླ་རེ་དང་།
en: At that time, those many buddhas will be aware of and know those excellent aromas of the incense, and they will see the canopies of incense and their golden color.

source: གསེར་གྱི་ཁ་དོག་དེ་དག་ཀྱང་གཟིགས་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཆོ་འཕྲུལ་བསྟན་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་མང་པོ་དེ་དག་གིས་མཐུན་པར་གཟིགས་ཤིང་སོ་སོར་བརྟགས་ཏེ། གསུང་མཐུན་པར་ཆོས་སྨྲ་བའི་མཁན་པོ་དེ་ལ་སྐྱེས་བུ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཤིན་ཏུ་ཟབ་པའི་མདོ་སྡེ་གྱ་ནོམ་པ་འདི་རྒྱ་ཆེར་ཡོངས་སུ་སྤེལ་ནས། བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་མཐའ་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་པ་ལེགས་སོ་ལེགས་སོ། །ཞེས་བསྔགས་པ་བརྗོད་པར་འགྱུར་རོ།
en: The buddha bhagavats of the ten directions, who are as numerous as the sand grains in the Ganges River, will manifest miracles, and those many buddha bhagavats, seeing and discriminating in the same way, will praise the dharmabhāṇaka, speaking to him in unison: ‘It is excellent, excellent that you, great being, have widely, greatly promulgated this wonderful, extremely profound sūtra and have perfected an incalculable, endless, and inconceivable accumulation of merit.’ “

source: །གང་ལ་ལ་ཞིག་མདོ་སྡེ་འདི་ལྟ་བུ་མཉན་ནས་ཐོས་པའི་བསོད་ནམས་གང་ཡིན་པ་དེའི་ཚད་ཀྱང་ཤིན་ཏུ་མང་བ་ཡིན་ན། ཡི་གེར་འདྲི་བ་དང་། ལེན་པ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་།
en: The merit of someone who listens to this sūtra is vast in extent, let alone that of someone who writes it out, obtains it, possesses it, reads it, teaches it to others, and practices it in accordance with its teaching.

source: གཞན་དག་ལ་ཡང་དག་པར་སྟོན་པ་དང་།
en: Why is that?

source: ཇི་སྐད་བསྟན་པ་བཞིན་དུ་མངོན་པར་སྒྲུབ་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས། དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུ་དག་སེམས་ཅན་གང་ལ་ལ་ཞིག་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་འདི་ཐོས་པར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པར་མི་འགྱུར་བས་སོ།
en: Noble ones, it is because those who hear The Supremely Victorious King of Sūtras, the Sublime Golden Light become irreversible in their progress to the highest, most complete enlightenment. “

source: །དེའི་ཚེ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་གསུང་གཅིག་ཏུ་ཆོས་ཀྱི་སྟན་ལ་འདུག་པའི་ཆོས་སྨྲ་བའི་མཁན་པོ་དེ་ལ་ལེགས་སོ་ལེགས་སོ།
en: At that time, the tathāgatas in countless, innumerable hundreds of thousands of quintillions of buddha realms, as numerous as the sand grains in the Ganges River, will speak in unison to the dharmabhāṇaka bhikṣu who is seated on the Dharma throne, praising him with the words, ‘Well done! Well done!

source: །ཞེས་བསྔགས་པ་འདི་བརྗོད་ནས་རིགས་ཀྱི་བུ་ཁྱོད་མ་འོངས་པའི་དུས་ན། བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཀྱིས་དཀའ་བ་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་མངོན་པར་བསྒྲུབས་ཏེ།
en: Noble one, in a future time, through the power of your diligence, you will accomplish countless hundreds of thousands of ascetic practices.

source: ཚོགས་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་འཕགས་པ་མང་པོ་ལས་ཡང་དག་པར་འདས་ཏེ། ཁམས་གསུམ་ལས་ངེས་པར་བྱུང་ནས་གཙོ་བོ་མཆོག་ཏུ་གྱུར་ཏེ་བྱང་ཆུབ་ཀྱི་ཤིང་གི་རྒྱལ་པོའི་དྲུང་དུ་འདུག་ནས། ཁྱད་པར་དུ་འཕགས་པ་རྣམས་ཀྱིས་ཡོངས་སུ་བརྒྱན་པར་འགྱུར། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་རྐྱེན་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྐྱོབ་པར་འགྱུར།
en: When you have completed the accumulations, you will transcend many āryas, you will emerge from the three realms and become a supreme leader, and you will sit at the foot of a Bodhi tree, will be adorned by that which is superior, and will be a refuge for the beings who have the necessary factors in the trichiliocosm world realm.

source: ཤིན་ཏུ་འཇིགས་སུ་རུང་བའི་བདུད་ཀྱི་དམག་ཚོགས་རྣམས་ཚར་གཅོད་པར་འགྱུར། ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཆོས་རྣམས་དང་། ཤིན་ཏུ་ཟབ་པའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་རབ་ཏུ་རྟོགས་པར་འགྱུར་རོ།
en: You will eliminate the terrifying armies of Māra and will realize the extremely profound, highest, most complete enlightenment. “ ‘

source: །རིགས་ཀྱི་བུ་ཁྱོད་རྡོ་རྗེའི་སྟན་ལ་འདུག་ནས་སངས་རྒྱས་རྣམས་ཀྱིས་རབ་ཏུ་བསྔགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བླ་ན་མེད་པ། ཤིན་ཏུ་ཟབ་པ་གྱ་ནོམ་པ་རྣམ་པ་བཅུ་གཉིས་ཡོངས་སུ་བསྐོར་བར་འགྱུར།
en: Noble one, having sat upon the vajra seat, you will turn the Dharma wheel that is praised by the buddhas and is unsurpassable, very profound, and has twelve wonderful aspects.

source: བླ་ན་མེད་པའི་ཆོས་ཀྱི་རྔ་ཆེན་པོ་མཆོག་ཏུ་གྱུར་པ་རབ་ཏུ་རྡུང་བར་འགྱུར།
en: You will beat the supreme, great drum of the highest Dharma.

source: བླ་ན་མེད་པའི་ཆོས་ཀྱི་དུང་ཤིན་ཏུ་གྱ་ནོམ་པ་འབུད་པར་འགྱུར།
en: You will blow the extremely wonderful conch of the highest Dharma.

source: བླ་ན་མེད་པའི་ཆོས་ཀྱི་རྒྱལ་མཚན་ཁྱད་པར་དུ་འཕགས་པ་སྒྲེང་བར་འགྱུར།
en: You will raise the superior banner of the highest Dharma.

source: བླ་ན་མེད་པའི་ཆོས་ཀྱི་སྒྲོན་མ་ཤིན་ཏུ་གསལ་བར་སྤར་བར་འགྱུར།
en: You will light the extremely bright lamp of the highest Dharma.

source: བླ་ན་མེད་པའི་བདུད་རྩིའི་ཆོས་ཀྱི་ཆར་རབ་ཏུ་འབེབས་པར་འགྱུར།
en: You will send down the rain of the unsurpassable amṛta of the Dharma.
